app/Http/Controllers/ArticleController.php

    public function index()
    {
        DB::listen(fn ($q) => logger($q->sql));

        $articles = Article::published()
            ->with('user')
            ->withCount('comments')
            ->latest()
            ->paginate(20);
---
select * from `users` where `users`.`id` in (3982, 3983, 3984, 3985, 3986, 3987, 3988, 3989, 3990, 3991, 3992, 3993, 3994, 3995, 3996, 3997, 3998, 3999, 4000, 4001)